### Terraform Plan - `aws` - Production 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=remember]
module.dynamodb_table_play.aws_dynamodb_table.this[0]: Refreshing state... [id=play]
module.dynamodb_table_loud.aws_dynamodb_table.this[0]: Refreshing state... [id=loud]
module.dynamodb_table_tts.aws_dynamodb_table.this[0]: Refreshing state... [id=tts]
module.dynamodb_table_sparkle.aws_dynamodb_table.this[0]: Refreshing state... [id=sparkle]
module.dynamodb_botdata.aws_dynamodb_table.this[0]: Refreshing state... [id=botdata]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dynamodb_eft_tracker.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "server_id"
      + id               = (known after apply)
      + name             = "eftitemtracker"
      + range_key        = "item"
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"       = "eftitemtracker"
          + "managed_by" = "terraform"
        }
      + tags_all         = {
          + "Name"       = "eftitemtracker"
          + "managed_by" = "terraform"
        }

      + attribute {
          + name = "item"
          + type = "S"
        }
      + attribute {
          + name = "server_id"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/aws`, Workflow: `deploy-ci`

### Terraform Plan - `k8s-cluster` - Production 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform azurerm_resource_group.default: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/errbot]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/errbot/providers/Microsoft.ContainerRegistry/registries/errbotacr]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/errbot/providers/Microsoft.Network/virtualNetworks/errbot_vnet]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/errbot/providers/Microsoft.Network/networkSecurityGroups/errbot_nsg]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/errbot/providers/Microsoft.Network/virtualNetworks/errbot_vnet/subnets/errbot_default_subnet]
azurerm_subnet_network_security_group_association.nsg_association: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/errbot/providers/Microsoft.Network/virtualNetworks/errbot_vnet/subnets/errbot_default_subnet]
azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourcegroups/errbot/providers/Microsoft.ContainerService/managedClusters/errbot-k8s]
azurerm_role_assignment.role_acrpull: Refreshing state... [id=/subscriptions/4321e9c7-b790-4d6b-a13c-2fac24800deb/resourceGroups/errbot/providers/Microsoft.ContainerRegistry/registries/errbotacr/providers/Microsoft.Authorization/roleAssignments/98ebabba-07cf-a90e-33da-d7cc741a3adc]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s-cluster`, Workflow: `deploy-ci`

### Terraform Plan - `k8s` - Production 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform module.promtail.kubectl_manifest.promtail_configmap[0]: Refreshing state... [id=/api/v1/namespaces/default/configmaps/promtail-config]
module.errbot.kubectl_manifest.errbot_namespace[1]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/errbot/networkpolicys/default-deny]
module.errbot.kubectl_manifest.errbot_namespace[0]: Refreshing state... [id=/api/v1/namespaces/errbot]
module.errbot_public.kubectl_manifest.errbot_namespace[1]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/errbot/networkpolicys/default-deny]
module.errbot_public.kubectl_manifest.errbot_namespace[0]: Refreshing state... [id=/api/v1/namespaces/errbot-public]
module.promtail.kubectl_manifest.promtail_deployment[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/promtail]
module.errbot_public.kubectl_manifest.errbot_network_policy[0]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/errbot-public/networkpolicys/errbot-network-policy]
module.promtail.kubectl_manifest.promtail_deployment[3]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/promtail]
module.promtail.kubectl_manifest.promtail_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/default/daemonsets/promtail]
module.promtail.kubectl_manifest.promtail_deployment[1]: Refreshing state... [id=/api/v1/namespaces/default/serviceaccounts/promtail]
module.errbot.kubectl_manifest.errbot_secret[0]: Refreshing state... [id=/api/v1/namespaces/errbot/secrets/errbot-secret]
module.errbot_public.kubectl_manifest.errbot_secret[0]: Refreshing state... [id=/api/v1/namespaces/errbot-public/secrets/errbot-secret]
module.errbot.kubectl_manifest.errbot_network_policy[0]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/errbot/networkpolicys/errbot-network-policy]
module.errbot_public.kubectl_manifest.errbot_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/errbot-public/deployments/errbot]
module.errbot.kubectl_manifest.errbot_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/errbot/deployments/errbot]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.errbot.kubectl_manifest.errbot_deployment[0] will be updated in-place
  ~ resource "kubectl_manifest" "errbot_deployment" {
        id                      = "/apis/apps/v1/namespaces/errbot/deployments/errbot"
        name                    = "errbot"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: errbot
              name: errbot
              namespace: errbot
            spec:
              replicas: 1
              selector:
                matchLabels:
                  name: errbot
              strategy: {}
              template:
                metadata:
                  annotations:
                    seccompProfile.security.alpha.kubernetes.io/pod: runtime/default
                  labels:
                    name: errbot
                spec:
                  automountServiceAccountToken: false
                  containers:
                  - env:
                    - name: BOT_NAME
                      value: errbot
                    - name: BACKEND
                      value: Discord
                    - name: BOT_STATUS_MESSAGE
                      value: errbot.birki.io | .help
                    - name: BOT_PREFIX
                      value: .
                    - name: BOT_HOME_CHANNEL
                      value: errbot
                    - name: DOCS_URL
                      value: https://errbot.birki.io
                    - name: BOT_ADMINS
                      value: Birki#0001
                    - name: BOT_EXTRA_BACKEND_DIR
                      value: /app/backend/err-backend-discord
                    - name: DISABLE_LEAGUE_CRON
                      value: "False"
                    - name: RIOT_REGION
                      value: na1
                    - name: RIOT_REGION_V5
                      value: AMERICAS
                    - name: IMAGE_TAG
          -           value: 79dc60b1a2bd75d1653348f85f593772a30c03e0
          +           value: 42dbd6ddd61243251affe14a4e7bc3d4df62324e
                    - name: SERVER_LOCK_ALLOW_LIST
                      value: "66199319505543168"
                    - name: CHAT_SERVICE_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: CHAT_SERVICE_TOKEN
                          name: errbot-secret
                    - name: RIOT_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: RIOT_TOKEN
                          name: errbot-secret
                    - name: AWS_ACCESS_KEY_ID
                      valueFrom:
                        secretKeyRef:
                          key: AWS_ACCESS_KEY_ID
                          name: errbot-secret
                    - name: AWS_SECRET_ACCESS_KEY
                      valueFrom:
                        secretKeyRef:
                          key: AWS_SECRET_ACCESS_KEY
                          name: errbot-secret
                    - name: SPOTIFY_CLIENT_ID
                      valueFrom:
                        secretKeyRef:
                          key: SPOTIFY_CLIENT_ID
                          name: errbot-secret
                    - name: SPOTIFY_CLIENT_SECRET
                      valueFrom:
                        secretKeyRef:
                          key: SPOTIFY_CLIENT_SECRET
                          name: errbot-secret
                    - name: SENTRY
                      valueFrom:
                        secretKeyRef:
                          key: SENTRY
                          name: errbot-secret
          -         image: errbotacr.azurecr.io/errbot:79dc60b1a2bd75d1653348f85f593772a30c03e0
          +         image: errbotacr.azurecr.io/errbot:42dbd6ddd61243251affe14a4e7bc3d4df62324e
                    imagePullPolicy: Always
                    name: errbot
                    resources:
                      limits:
                        cpu: "1.0"
                        memory: 1Gi
                      requests:
                        cpu: "0.25"
                        memory: 100Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      privileged: false
        EOT
        # (11 unchanged attributes hidden)
    }

  # module.errbot_public.kubectl_manifest.errbot_deployment[0] will be updated in-place
  ~ resource "kubectl_manifest" "errbot_deployment" {
        id                      = "/apis/apps/v1/namespaces/errbot-public/deployments/errbot"
        name                    = "errbot"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: errbot
              name: errbot
              namespace: errbot-public
            spec:
              replicas: 1
              selector:
                matchLabels:
                  name: errbot
              strategy: {}
              template:
                metadata:
                  annotations:
                    seccompProfile.security.alpha.kubernetes.io/pod: runtime/default
                  labels:
                    name: errbot
                spec:
                  automountServiceAccountToken: false
                  containers:
                  - env:
                    - name: BOT_NAME
                      value: errbot-public
                    - name: BACKEND
                      value: Discord
                    - name: BOT_STATUS_MESSAGE
                      value: errbot.birki.io | .help
                    - name: BOT_PREFIX
                      value: .
                    - name: BOT_HOME_CHANNEL
                      value: errbot
                    - name: DOCS_URL
                      value: https://errbot.birki.io
                    - name: BOT_ADMINS
                      value: Birki#0001
                    - name: BOT_EXTRA_BACKEND_DIR
                      value: /app/backend/err-backend-discord
                    - name: DISABLE_LEAGUE_CRON
                      value: "True"
                    - name: RIOT_REGION
                      value: na1
                    - name: RIOT_REGION_V5
                      value: AMERICAS
                    - name: IMAGE_TAG
          -           value: 79dc60b1a2bd75d1653348f85f593772a30c03e0
          +           value: 42dbd6ddd61243251affe14a4e7bc3d4df62324e
                    - name: SERVER_LOCK_ALLOW_LIST
                      value: "66199319505543168"
                    - name: CHAT_SERVICE_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: CHAT_SERVICE_TOKEN
                          name: errbot-secret
                    - name: RIOT_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: RIOT_TOKEN
                          name: errbot-secret
                    - name: AWS_ACCESS_KEY_ID
                      valueFrom:
                        secretKeyRef:
                          key: AWS_ACCESS_KEY_ID
                          name: errbot-secret
                    - name: AWS_SECRET_ACCESS_KEY
                      valueFrom:
                        secretKeyRef:
                          key: AWS_SECRET_ACCESS_KEY
                          name: errbot-secret
                    - name: SPOTIFY_CLIENT_ID
                      valueFrom:
                        secretKeyRef:
                          key: SPOTIFY_CLIENT_ID
                          name: errbot-secret
                    - name: SPOTIFY_CLIENT_SECRET
                      valueFrom:
                        secretKeyRef:
                          key: SPOTIFY_CLIENT_SECRET
                          name: errbot-secret
                    - name: SENTRY
                      valueFrom:
                        secretKeyRef:
                          key: SENTRY
                          name: errbot-secret
          -         image: errbotacr.azurecr.io/errbot:79dc60b1a2bd75d1653348f85f593772a30c03e0
          +         image: errbotacr.azurecr.io/errbot:42dbd6ddd61243251affe14a4e7bc3d4df62324e
                    imagePullPolicy: Always
                    name: errbot
                    resources:
                      limits:
                        cpu: "1.0"
                        memory: 1Gi
                      requests:
                        cpu: "0.25"
                        memory: 100Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      privileged: false
        EOT
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ errbot_image_tag = "79dc60b1a2bd75d1653348f85f593772a30c03e0" -> "42dbd6ddd61243251affe14a4e7bc3d4df62324e"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s`, Workflow: `deploy-ci`